Revit 2024 API
BuiltInFailures.MassFailures.DividePerimeterZoneFailed Property
 Failed to divide perimeter zone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividePerimeterZoneFailed { get; }
Visual Basic
Public Shared ReadOnly Property DividePerimeterZoneFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividePerimeterZoneFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace